export const predefinedSizes: { [key: string]: number } = {
  "009540_HD한국조선해양_daily_data": 13574300000000,  // 약 13.57조 원
  "267260_HD현대일렉트릭_daily_data": 11320000000000,  // 약 11.32조 원
  "329180_HD현대중공업_daily_data": 13430000000000,  // 약 13.43조 원
  "011200_HMM_daily_data": 13210000000000,  // 약 13.21조 원
  "105560_KB금융_daily_data": 35020000000000,  // 약 35.02조 원
  "030200_KT_daily_data": 9980000000000,  // 약 9.98조 원
  "003550_LG_daily_data": 12780000000000,  // 약 12.78조 원
  "373220_LG에너지솔루션_daily_data": 84010000000000,  // 약 84.01조 원
  "011070_LG이노텍_daily_data": 6010000000000,  // 약 6.01조 원
  "066570_LG전자_daily_data": 16950000000000,  // 약 16.95조 원
  "051910_LG화학_daily_data": 23880000000000,  // 약 23.88조 원
  "079550_LIG넥스원_daily_data": 4160000000000,  // 약 4.16조 원
  "006260_LS_daily_data": 3720000000000,  // 약 3.72조 원
  "010120_LSELECTRIC_daily_data": 5110000000000,  // 약 5.11조 원
  "229640_LS에코에너지_daily_data": 8529030000000,  // 약 8.53조 원
  "035420_NAVER_daily_data": 26510000000000,  // 약 26.51조 원
  "005490_POSCO홀딩스_daily_data": 28750000000000,  // 약 28.75조 원
  "034730_SK_daily_data": 10350000000000,  // 약 10.35조 원
  "011790_SKC_daily_data": 4740000000000,  // 약 4.74조 원
  "402340_SK스퀘어_daily_data": 11000000000000,  // 약 11.00조 원
  "096770_SK이노베이션_daily_data": 10190000000000,  // 약 10.19조 원
  "017670_SK텔레콤_daily_data": 12050000000000,  // 약 12.05조 원
  "000660_SK하이닉스_daily_data": 135040000000000,  // 약 135.04조 원
  "010130_고려아연_daily_data": 11060000000000,  // 약 11.06조 원
  "001570_금양_daily_data": 3200000000000,  // 약 3.20조 원
  "000270_기아_daily_data": 41590000000000,  // 약 41.59조 원
  "024110_기업은행_daily_data": 11290000000000,  // 약 11.29조 원
  "006340_대원전선_daily_data": 2575250000000,  // 약 2.58조 원
  "001440_대한전선_daily_data": 23800000000000,  // 약 2.38조 원
  "034020_두산에너빌리티_daily_data": 11540000000000,  // 약 11.54조 원
  "138040_메리츠금융지주_daily_data": 17930000000000,  // 약 17.93조 원
  "006400_삼성SDI_daily_data": 23070000000000,  // 약 23.07조 원
  "028260_삼성물산_daily_data": 26780000000000,  // 약 26.78조 원
  "207940_삼성바이오로직스_daily_data": 68110000000000,  // 약 68.11조 원
  "032830_삼성생명_daily_data": 19480000000000,  // 약 19.48조 원
  "018260_삼성에스디에스_daily_data": 11520000000000,  // 약 11.52조 원
  "009150_삼성전기_daily_data": 10880000000000,  // 약 10.88조 원
  "005930_삼성전자_daily_data": 515210000000000,  // 약 515.21조 원
  "005935_삼성전자우_daily_data": 517595730000000,  // 약 517.60조 원
  "010140_삼성중공업_daily_data": 9290000000000,  // 약 9.29조 원
  "000810_삼성화재_daily_data": 17740000000000,  // 약 17.74조 원
  "003230_삼양식품_daily_data": 3770000000000,  // 약 3.77조 원
  "068270_셀트리온_daily_data": 43950000000000,  // 약 43.95조 원
  "055550_신한지주_daily_data": 30105100000000,  // 약 30.10조 원
  "090430_아모레퍼시픽_daily_data": 7510000000000,  // 약 7.51조 원
  "006740_영풍제지_daily_data": 6256500000000,  // 약 6.26조 원
  "316140_우리금융지주_daily_data": 12280000000000,  // 약 12.28조 원
  "000100_유한양행_daily_data": 8680000000000,  // 약 8.68조 원
  "457190_이수스페셜티케미컬_daily_data": 1370000000000,  // 약 1.37조 원
  "007660_이수페타시스_daily_data": 2830000000000,  // 약 2.83조 원
  "035720_카카오_daily_data": 16610000000000,  // 약 16.61조 원
  "323410_카카오뱅크_daily_data": 10440000000000,  // 약 10.44조 원
  "259960_크래프톤_daily_data": 16670000000000,  // 약 16.67조 원
  "047050_포스코인터내셔널_daily_data": 9320000000000,  // 약 9.32조 원
  "003670_포스코퓨처엠_daily_data": 16540000000000,  // 약 16.54조 원
  "086790_하나금융지주_daily_data": 19680000000000,  // 약 19.68조 원
  "352820_하이브_daily_data": 7360000000000,  // 약 7.36조 원
  "036460_한국가스공사_daily_data": 4490000000000,  // 약 4.49조 원
  "004090_한국석유_daily_data": 13610000000000,  // 약 13.61조 원
  "015760_한국전력_daily_data": 13610000000000,  // 약 13.61조 원
  "042700_한미반도체_daily_data": 11430000000000,  // 약 11.43조 원
  "009830_한화솔루션_daily_data": 4460000000000,  // 약 4.46조 원
  "012450_한화에어로스페이스_daily_data": 13950000000000,  // 약 13.95조 원
  "042660_한화오션_daily_data": 10160000000000,  // 약 10.16조 원
  "064350_현대로템_daily_data": 5880000000000,  // 약 5.88조 원
  "012330_현대모비스_daily_data": 20410000000000,  // 약 20.41조 원
  "005380_현대차_daily_data": 63300000000000,  // 약 63.3조 원
  "247540_에코프로비엠_daily_data": 17020000000000,  // 약 17.02조 원
  "123123_알테오젠_daily_data": 16740000000000,  // 약 16.74조 원
  "033780_KT&G_daily_data": 13980000000000,  // 약 13.98조 원
  "086520_에코프로_daily_data": 11560000000000,  // 약 11.56조 원
  "028300_HLB_daily_data": 11230000000000  // 약 11.23조 원
};


function calculateProportionalSizes(predefinedSizes: { [key: string]: number }): { [key: string]: number } {
  const totalMarketCap = Object.values(predefinedSizes).reduce((sum: number, marketCap: number) => sum + marketCap, 0);
  
  const proportionalSizes: { [key: string]: number } = {};
  for (const [company, marketCap] of Object.entries(predefinedSizes)) {
    proportionalSizes[company] = (marketCap / totalMarketCap) * 1000; // 1000을 기준으로 비율 계산
  }
  return proportionalSizes;
}

export const proportionalSizes = calculateProportionalSizes(predefinedSizes);
